## 1. DATA

#### Data used for this project was obtained from the below websites. Two datasets are included, one provides the half hourly Load Demand in MegaWatts (MW) for Dublin, Ireland, over a period of two years, 2018 to 2020, and the other provides the daily weather data over the same period.

https://transparency.entsoe.eu/

https://www.met.ie/climate/available-data/historical-data

In [1]:
# Import python libraries

import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

## 2. IMPORTING DATA

#### Both Datasets are .csv files

In [2]:
# Import Data

Demand = pd.read_csv('Demand.csv')

print(Demand)

len(Demand)

                           start                        end  Demand (MW)
0      2017-06-22 11:00:00+00:00  2017-06-22 11:30:00+00:00         3507
1      2017-06-22 11:30:00+00:00  2017-06-22 12:00:00+00:00         3523
2      2017-06-22 12:00:00+00:00  2017-06-22 12:30:00+00:00         3535
3      2017-06-22 12:30:00+00:00  2017-06-22 13:00:00+00:00         3475
4      2017-06-22 13:00:00+00:00  2017-06-22 13:30:00+00:00         3480
...                          ...                        ...          ...
54233  2020-07-28 09:30:00+00:00  2020-07-28 10:00:00+00:00         3587
54234  2020-07-28 10:00:00+00:00  2020-07-28 10:30:00+00:00         3600
54235  2020-07-28 10:30:00+00:00  2020-07-28 11:00:00+00:00         3551
54236  2020-07-28 11:00:00+00:00  2020-07-28 11:30:00+00:00         3595
54237  2020-07-28 11:30:00+00:00  2020-07-28 12:00:00+00:00         3624

[54238 rows x 3 columns]

54238

In [3]:
Demand.head()

                       start                        end  Demand (MW)
0  2017-06-22 11:00:00+00:00  2017-06-22 11:30:00+00:00         3507
1  2017-06-22 11:30:00+00:00  2017-06-22 12:00:00+00:00         3523
2  2017-06-22 12:00:00+00:00  2017-06-22 12:30:00+00:00         3535
3  2017-06-22 12:30:00+00:00  2017-06-22 13:00:00+00:00         3475
4  2017-06-22 13:00:00+00:00  2017-06-22 13:30:00+00:00         3480

In [4]:
Demand.tail()

                           start                        end  Demand (MW)
54233  2020-07-28 09:30:00+00:00  2020-07-28 10:00:00+00:00         3587
54234  2020-07-28 10:00:00+00:00  2020-07-28 10:30:00+00:00         3600
54235  2020-07-28 10:30:00+00:00  2020-07-28 11:00:00+00:00         3551
54236  2020-07-28 11:00:00+00:00  2020-07-28 11:30:00+00:00         3595
54237  2020-07-28 11:30:00+00:00  2020-07-28 12:00:00+00:00         3624

In [5]:
# Import Data

Weather = pd.read_csv('Weather.csv')

print(Weather)

len(Weather)

     Station Name: PHOENIX PARK Unnamed: 1 Unnamed: 2 Unnamed: 3 Unnamed: 4
0         Station Height: 48 M         NaN        NaN        NaN        NaN
1             Latitude:53.364          NaN        NaN        NaN        NaN
2                           NaN        NaN        NaN        NaN        NaN
3                           NaN        NaN        NaN        NaN        NaN
4        date:  -  00 to 00 utc        NaN        NaN        NaN        NaN
...                         ...        ...        ...        ...        ...
1102                  27-Dec-20        6.2        1.2        4.1      3.999
1103                  28-Dec-20        5.3        2.7        1.2      3.757
1104                  29-Dec-20        5.8        1.1        0.3      3.003
1105                  30-Dec-20        2.8       -1.5          0       2.03
1106                  31-Dec-20        4.7       -1.7        1.7       1.46

[1107 rows x 5 columns]

1107

In [6]:
Weather.head()

  Station Name: PHOENIX PARK Unnamed: 1 Unnamed: 2 Unnamed: 3 Unnamed: 4
0      Station Height: 48 M         NaN        NaN        NaN        NaN
1          Latitude:53.364          NaN        NaN        NaN        NaN
2                        NaN        NaN        NaN        NaN        NaN
3                        NaN        NaN        NaN        NaN        NaN
4     date:  -  00 to 00 utc        NaN        NaN        NaN        NaN

In [9]:
Weather.head()

                     date maxtemp mintemp rainfall soiltemp
0   Station Height: 48 M      NaN     NaN      NaN      NaN
1       Latitude:53.364       NaN     NaN      NaN      NaN
2                     NaN     NaN     NaN      NaN      NaN
3                     NaN     NaN     NaN      NaN      NaN
4  date:  -  00 to 00 utc     NaN     NaN      NaN      NaN

In [8]:
Weather.columns = ['date', 'maxtemp', 'mintemp', 'rainfall', 'soiltemp' ]

Weather.head()

                     date maxtemp mintemp rainfall soiltemp
0   Station Height: 48 M      NaN     NaN      NaN      NaN
1       Latitude:53.364       NaN     NaN      NaN      NaN
2                     NaN     NaN     NaN      NaN      NaN
3                     NaN     NaN     NaN      NaN      NaN
4  date:  -  00 to 00 utc     NaN     NaN      NaN      NaN

## 3. DATA PREPARATION

In [ ]:
# Create Pandas DataFrame